<!-- JS FILES -->
<script>
    var nameNumber = "extra_fields[custom_field_9Qwgx6q0uKIMzQAZ]";
    var nameWilaya = "extra_fields[custom_field_X3Bnm95MWmqlwmxB]";
    var nameCommune = "extra_fields[custom_field_bGpO8cafCRkknI0b]";
    var stoppdesk = "extra_fields[custom_field_lpYEJ0XmZB2Fb09w]";
    const fieldName = "CAPTCHA TAG HERE";

    var submitButtons = document.getElementsByClassName("single-submit");
    var my_pattern = document.getElementsByName(nameNumber)[0];
    my_pattern.setAttribute("id", nameNumber);
    my_pattern.setAttribute("oninput", "validatePhoneInputs()");
    my_pattern.setAttribute("pattern", "(05|06|07)[0-9]{8}");

    function validatePhoneInputs() {
        var phoneInput = document.getElementById(nameNumber);
        var submitButton = document.querySelector(".single-submit");

        if (phoneInput.value.match(/^(05|06|07)[0-9]{8}$/)) {
            phoneInput.style.setProperty("background-color", "white", "important");
            phoneInput.style.setProperty("color", "black", "important");
            submitButton.removeAttribute("disabled");
        } else {
            phoneInput.style.setProperty("background-color", "#f8d7da", "important");
            phoneInput.style.setProperty("color", "black", "important");
            submitButton.setAttribute("disabled", "");
        }
    }

    var captchaInput = document.getElementsByName(fieldName)[0];
    captchaInput.setAttribute("oninput", "validateCaptchaInputs()");

    function validateCaptchaInputs() {
        var inputcaptchavalue = captchaInput.value;
        var submitButton = document.querySelector(".single-submit");

        if (inputcaptchavalue === captchavalue) {
            captchaInput.style.setProperty("background-color", "white", "important");
            captchaInput.style.setProperty("color", "black", "important");
            submitButton.removeAttribute("disabled");
        } else {
            captchaInput.style.setProperty("background-color", "#f8d7da", "important");
            captchaInput.style.setProperty("color", "black", "important");
            submitButton.setAttribute("disabled", "");
        }
    }

    var my_commune = document.getElementsByName(nameCommune)[0];
    my_commune.setAttribute("id", "citySelect");
    my_commune.setAttribute("required", "");
    my_commune.setAttribute("onchange", "validateBaladiyaInputs()");

    function validateBaladiyaInputs() {
        var inputbaladiyavalue = my_commune.value;
        var submitButton = document.querySelector(".single-submit");

        if (inputbaladiyavalue === "إختر البلدية") {
            my_commune.style.setProperty("background-color", "#f8d7da", "important");
            my_commune.style.setProperty("color", "black", "important");
            submitButton.setAttribute("disabled", "");
        } else {
            my_commune.style.setProperty("background-color", "white", "important");
            my_commune.style.setProperty("color", "black", "important");
            submitButton.removeAttribute("disabled");
        }
    }

    var my_wilaya = document.getElementsByName(nameWilaya)[0];
    my_wilaya.setAttribute("id", "countrySelect");
    my_wilaya.setAttribute("onchange", "validateWilayaInputs()");
    my_wilaya.setAttribute("required", "");

    function validateWilayaInputs() {
        var inputwilayaavalue = my_wilaya.value;
        var submitButton = document.querySelector(".single-submit");



        if (inputwilayaavalue === "إختر الولاية") {
            my_wilaya.style.setProperty("background-color", "#f8d7da", "important");
            my_wilaya.style.setProperty("color", "black", "important");
            submitButton.setAttribute("disabled", "");
        } else {
            my_wilaya.style.setProperty("background-color", "white", "important");
            my_wilaya.style.setProperty("color", "black", "important");
            submitButton.removeAttribute("disabled");
        }
    }

    validateBaladiyaInputs();
    validateWilayaInputs();
</script>

<script>
    var communes = [],
        wilaya = [
            "01 ~ أدرار",
            "02 ~ الشلف",
            "03 ~ الأغواط",
            "04 ~ أم البواقي",
            "05 ~ باتنة",
            "06 ~ بجاية",
            "07 ~ بسكرة",
            "08 ~ بشار",
            "09 ~ البليدة",
            "10 ~ البويرة",
            "11 ~ تمنراست",
            "12 ~ تبسة",
            "13 ~ تلمسان",
            "14 ~ تيارت",
            "15 ~ تيزي وزو",
            "16 ~ الجزائر",
            "17 ~ الجلفة",
            "18 ~ جيجل",
            "19 ~ سطيف",
            "20 ~ السعيدة",
            "21 ~ سكيكدة",
            "22 ~ سيدي بلعباس",
            "23 ~ عنابة",
            "24 ~ قالمة",
            "25 ~ قسنطينة",
            "26 ~ المدية",
            "27 ~ مستغانم",
            "28 ~ المسيلة",
            "29 ~ معسكر",
            "30 ~ ورقلة",
            "31 ~ وهران",
            "32 ~ البيض",
            "33 ~ إليزي",
            "34 ~ برج بوعريريج",
            "35 ~ بومرداس",
            "36 ~ الطارف",
            "37 ~ تندوف",
            "38 ~ تسيمسيلت",
            "39 ~ الوادي(واد سوف)",
            "40 ~ خنشلة",
            "41 ~ سوق اهراس",
            "42 ~ تيبازة",
            "43 ~ ميلة",
            "44 ~ عين الدفلى",
            "45 ~ النعامة",
            "46 ~ عين تموشنت",
            "47 ~ غرداية",
            "48 ~ غليزان",
            "49 ~ تيميمون",
            "50 ~ برج باجي مختار",
            "51 ~ أولاد جلال",
            "52 ~ بني عباس",
            "53 ~ عين صالح",
            "54 ~ عين قزام",
            "55 ~ توقرت",
            "56 ~ جانت",
            "57 ~ المغير",
            "58 ~ المنيعة",
        ];
    function add() {
        communes.forEach((a) => {
            var e = document.createElement("option");
            (e.innerHTML = a), (e.value = a), document.body.querySelector("select[name='" + nameCommune + "").appendChild(e);
        });
    }
    wilaya.forEach((a) => {
        var e = document.createElement("option");
        (e.innerHTML = a), (e.value = a), document.body.querySelector("select[name='" + nameWilaya + "']").appendChild(e);
    }),
        document.body.querySelector("select[name='" + nameWilaya + "']").addEventListener("change", () => {
            for (var a = document.body.querySelector("select[name='" + nameWilaya + "']").value, e = document.body.querySelector("select[name='" + nameCommune + ""); 1 < e.childNodes.length; ) e.removeChild(e.lastChild);
            "01 ~ أدرار" == a &&
                (console.log("wilaya"),
                (communes = [
                    "أدرار",
                    "تامست",
                    "شروين",
                    "رقان  ",
                    "إن زغمير  ",
                    "تيت",
                    "قصر قدور",
                    "تسابيت",
                    "تيميمون",
                    "أولاد السعيد",
                    "زاوية كونتة",
                    "أولف",
                    "تيمقتن",
                    "تامنطيت",
                    "فنوغيل",
                    "تنركوك",
                    "دلدول",
                    "سالي",
                    "أقبلي",
                    "المطارفة",
                    "أولاد أحمد تيمي",
                    "بودة",
                    "أوقروت",
                    "طالمين",
                    "برج باجي مختار",
                    "السبع",
                    "أولاد عيسى",
                    "تيمياوين",
                ]),
                add(),
                shippingprice("01")),
                "02 ~ الشلف" == a &&
                    (console.log("wilaya"),
                    (communes = [
                        "الشلف",
                        "تنس",
                        "بنايرية",
                        "الكريمية",
                        "تاجنة",
                        "تاوقريت",
                        "بني حواء",
                        "صبحة",
                        "حرشون",
                        "أولاد فارس",
                        "سيدي عكاشة",
                        "بوقادير",
                        "بني راشد",
                        "تلعصة",
                        "الهرنفة",
                        "وادى قوسين",
                        "الظهرة",
                        "أولاد عباس",
                        "السنجاس",
                        "الزبوجة",
                        "وادي سلي",
                        "أبو الحسن",
                        "المرسى",
                        "الشطية",
                        "سيدي عبد الرحمان",
                        "مصدق",
                        "الحجاج",
                        "الأبيض مجاجة",
                        "وادي الفضة",
                        "أولاد بن عبد القادر",
                        "بوزغاية",
                        "عين مران",
                        "أم الذروع",
                        "بريرة",
                        "بني بوعتاب",
                    ]),
                    add(),
                    shippingprice("02")),
                "03 ~ الأغواط" == a &&
                    ((communes = [
                        "الأغواط",
                        "قصر الحيران",
                        "بن ناصر بن شهرة",
                        "سيدي مخلوف",
                        "حاسي الدلاعة",
                        "حاسي الرمل",
                        "عين ماضي",
                        "تاجموت",
                        "الخنق",
                        "قلتة سيدي سعد",
                        "عين سيدي علي",
                        "البيضاء",
                        "بريدة",
                        "الغيشة",
                        "الحاج المشري",
                        "سبقاق",
                        "تاويالة",
                        "تاجرونة",
                        "أفلو",
                        "العسافية",
                        "وادي مرة",
                        "وادي مزي",
                        "الحويطة",
                        "سيدي بوزيد",
                    ]),
                    add(),
                    shippingprice("03")),
                "04 ~ أم البواقي" == a &&
                    ((communes = [
                        "أم البواقي",
                        "عين البيضاء",
                        "عين مليلة",
                        "بحير شرقي",
                        "العامرية",
                        "سيقوس",
                        "البلالة",
                        "عين بابوش",
                        "بريش",
                        "أولاد حملة",
                        "الضلعة",
                        "عين كرشة",
                        "هنشير تومغني",
                        "الجازية",
                        "عين الديس",
                        "فكرينة",
                        "سوق نعمان",
                        "الزرق",
                        "الفجوج بوغرارة سعودي",
                        "أولاد زواي",
                        "بئر الشهداء",
                        "قصر صباحي",
                        "وادي نيني",
                        "مسكيانة",
                        "عين فكرون",
                        "الراحية",
                        "عين الزيتون",
                        "أولاد قاسم",
                        "الحرميلية",
                    ]),
                    add(),
                    shippingprice("04")),
                "05 ~ باتنة" == a &&
                    ((communes = [
                        "باتنة",
                        "غسيرة",
                        "معافة",
                        "مروانة",
                        "سريانة",
                        "منعة",
                        "المعذر",
                        "تازولت",
                        "نقاوس",
                        "القيقبة",
                        "إينوغيسن",
                        "عيون العصافير",
                        "جرمة",
                        "بيطام",
                        "عزيل عبد القادر",
                        "آريس",
                        "كيمل",
                        "تيلاطو",
                        "عين جاسر",
                        "أولاد سلام",
                        "تيغرغار",
                        "عين ياقوت",
                        "سفيان",
                        "فسديس",
                        "الرحبات",
                        "تيغانمين",
                        "لمسان",
                        "قصر بلزمة",
                        "سقانة",
                        "إشمول",
                        "فم الطوب",
                        "بني فضالة الحقانية",
                        "وادي الماء",
                        "تالخمت",
                        "بوزينة",
                        "الشمرة",
                        "وادي الشعبة",
                        "تاكسلانت",
                        "القصبات",
                        "أولاد عوف",
                        "بومقر",
                        "بريكة",
                        "الجزار",
                        "تكوت",
                        "عين التوتة",
                        "حيدوسة",
                        "ثنية العابد",
                        "وادي الطاقة",
                        "أولاد فاضل",
                        "تيمقاد",
                        "رأس العيون",
                        "شير",
                        "أولاد سي سليمان",
                        "زانة البيضاء",
                        "أمدوكال",
                        "أولاد عمار",
                        "الحاسي",
                        "لازرو",
                        "بومية",
                        "بولهيلات",
                        "لارباع",
                    ]),
                    add(),
                    shippingprice("05")),
                "06 ~ بجاية" == a &&
                    ((communes = [
                        "بجاية",
                        "بوخليفة",
                        "تيشي",
                        "تالة حمزة",
                        "أميزور",
                        "تامريجت",
                        "أوقاس",
                        "آيت سماعيل",
                        "تاسكريوت",
                        "تمقرة",
                        "آغرام",
                        "كسيلة",
                        "تاوريرت آغيل",
                        "أمالو",
                        "بوحمزة",
                        "كنديرة",
                        "خراطة",
                        "فرعون",
                        "بني جليل",
                        "القصر",
                        "توجة",
                        "بوجليل",
                        "بني مليكش",
                        "سوق أوفلة",
                        "شميني",
                        "تيفرة",
                        "تينبذار",
                        "سيدي عياد",
                        "تيمزريت",
                        "سيدي عيش",
                        "لفلاي",
                        "أكفادو",
                        "تيبيان",
                        "آيت أرزين",
                        "إيغيل علي",
                        "فناية الماثن",
                        "سمعون",
                        "ذراع القايد",
                        "مرباشة",
                        "مسيسنة",
                        "صدوق",
                        "أوزلاقن",
                        "آدكار",
                        "شلاطة",
                        "أقبو",
                        "بني معوش",
                        "درقينة",
                        "تيزي أنبربار",
                        "سوق الإثنين",
                        "ملبو",
                        "وادي غير",
                        "تازمالت",
                        "شميني جنان",
                    ]),
                    add(),
                    shippingprice("06")),
                "07 ~ بسكرة" == a &&
                    ((communes = [
                        "بسكرة",
                        "ليوة",
                        "لوطاية",
                        "جمورة",
                        "البرانيس",
                        "القنطرة",
                        "عين زعطوط",
                        "سيدي عقبة",
                        "شتمة",
                        "تكوت",
                        "الحوش",
                        "عين الناقة",
                        "زربية الوادي",
                        "المزيرعة",
                        "خنقة سيدي ناجي",
                        "الفيض",
                        "مشونش",
                        "طولقة",
                        "بوشقرون",
                        "برج بن عزوز",
                        "ليشانه",
                        "فوغاله",
                        "الغروس",
                        "أولاد جلال",
                        "الدوسن",
                        "الشعيبة",
                        "سيدي خالد",
                        "البسباس",
                        "راس الميعاد",
                        "اورلال",
                        "أوماش",
                        "مليلي",
                        "مخادمة",
                        "الحاجب",
                    ]),
                    add(),
                    shippingprice("07")),
                "08 ~ بشار" == a &&
                    ((communes = [
                        "بسكرة",
                        "ليوة",
                        "لوطاية",
                        "جمورة",
                        "البرانيس",
                        "القنطرة",
                        "عين زعطوط",
                        "سيدي عقبة",
                        "شتمة",
                        "تكوت",
                        "الحوش",
                        "عين الناقة",
                        "زربية الوادي",
                        "المزيرعة",
                        "خنقة سيدي ناجي",
                        "الفيض",
                        "مشونش",
                        "طولقة",
                        "بوشقرون",
                        "برج بن عزوز",
                        "ليشانه",
                        "فوغاله",
                        "الغروس",
                        "أولاد جلال",
                        "الدوسن",
                        "الشعيبة",
                        "سيدي خالد",
                        "البسباس",
                        "راس الميعاد",
                        "اورلال",
                        "أوماش",
                        "مليلي",
                        "مخادمة",
                        "الحاجب",
                    ]),
                    add(),
                    shippingprice("08")),
                "09 ~ البليدة" == a &&
                    ((communes = [
                        "البليدة",
                        "شبلي",
                        "بوينان",
                        "وادي العلايق",
                        "أولاد يعيش",
                        "الشريعة",
                        "العفرون",
                        "الشفة",
                        "حمام ملوان",
                        "بن خليل",
                        "الصومعة",
                        "موزاية",
                        "صوحان",
                        "مفتاح",
                        "أولاد السلامة",
                        "بوفاريك",
                        "الأربعاء",
                        "واد جر",
                        "بني تامو",
                        "بوعرفة",
                        "بني مراد",
                        "بوقرة",
                        "قرواو",
                        "عين الرمانة",
                        "الجبابرة",
                    ]),
                    add(),
                    shippingprice("09")),
                "10 ~ البويرة" == a &&
                    ((communes = [
                        "البويرة",
                        "عين الترك",
                        "ايت لعزيز",
                        "الأخضرية",
                        "قرومة",
                        "معالة",
                        "بودربالة",
                        "بوكرام",
                        "الزبربر",
                        "قادرية",
                        "عمر",
                        "جباحية",
                        "سوق الخميس",
                        "المقراني",
                        "بئر اغبالو",
                        "الروراوة",
                        "الخبوزية",
                        "عين بسام",
                        "عين العلوي",
                        "عين الحجر",
                        "سور الغزلان",
                        "المعمورة",
                        "ديرة",
                        "ريدان",
                        "الحاكمية",
                        "الدشمية",
                        "برج اخريص",
                        "مسدور",
                        "تاقديت",
                        "الحجرة الزرقاء",
                        "الهاشمية",
                        "وادي البردي",
                        "امشدالة",
                        "احنيف",
                        "الشرفة",
                        "صحاريج",
                        "اث منصور",
                        "اغبالو",
                        "بشلول",
                        "العجيبية",
                        "الأسنام",
                        "اهل القصر",
                        "اولاد راشد",
                        "حيزر",
                        "تاغزوت",
                    ]),
                    add(),
                    shippingprice("10")),
                "11 ~ تمنراست" == a && ((communes = ["تمنراست", "ابلسة", "ادلس", "فقارة الزوى", "عين غار", "عين قزام", "عين صالح", "تاظروك", "تين زاوتين", "عين امقل"]), add(), shippingprice("11")),
                "12 ~ تبسة" == a &&
                    ((communes = [
                        "بئر العاتر",
                        "الشريعة سطح قنطيس",
                        "العوينات",
                        "الحويجبات",
                        "صفصاف الوسرة",
                        "الحمامات",
                        "نقرين",
                        "بئر مقدم",
                        "الكويف",
                        "مرسط",
                        "العقلة",
                        "بئر الذهب",
                        "العقلة المالحة",
                        "قريقر",
                        "بكارية",
                        "بوخضرة",
                        "الونزة",
                        "الماء الأبيض",
                        "أم علي",
                        "ثليجان",
                        "عين الزرقاء",
                        "المريج",
                        "بولحاف الدير",
                        "بجن",
                        "المزرعة",
                        "فركان",
                    ]),
                    add(),
                    shippingprice("12")),
                "13 ~ تلمسان" == a &&
                    ((communes = [
                        "تلمسان",
                        "المنصورة",
                        "تيرني بني ھديل",
                        "عين غرابة",
                        "بني مستار",
                        "شتوان",
                        "عين فزة",
                        "عمير",
                        "أولاد ميمون",
                        "الواد الأخضر",
                        "بني صميل",
                        "عين تالوت",
                        "عين نحالة",
                        "بن سكران",
                        "سيدي العبدلي",
                        "الرمشي",
                        "بني ورسوس",
                        "عين يوسف",
                        "السبعة شيوخ",
                        "الفحول",
                        "الحناية",
                        "زناتة",
                        "أولاد رياح",
                        "الغزوات",
                        "السواحلية",
                        "تيانت",
                        "دار يغمراسن",
                        "ندرومة",
                        "جبالة",
                        "فلاوسن",
                        "عين فتاح",
                        "عين الكبيرة",
                        "مغنية",
                        "حمام بوغرارة",
                        "بني بوسعيد",
                        "سيدي مجاهد",
                        "صبرة",
                        "بوحلو",
                        "سبدو",
                        "القور",
                        "العريشة",
                        "سيدي الجيلالي",
                        "البويهي",
                        "بني سنوس",
                        "العزايل",
                        "بني بهدل",
                        "باب العسة",
                        "السواني",
                        "سوق الثلاثاء",
                        "مرسى بن مهيدي",
                        "مسيردة الفواقة",
                        "هنين",
                        "بني خلاد",
                    ]),
                    add(),
                    shippingprice("13")),
                "14 ~ تيارت" == a &&
                    ((communes = [
                        "توسنينة",
                        "عين بوشقيف",
                        "عين الذهب",
                        "عين الحديد",
                        "عين الكرمة",
                        "عين زاريت",
                        "بوغرة,",
                        "شهايمة",
                        "دحموني",
                        "جبيلات رصفة",
                        "جيلالي بن عمر",
                        "فايجة",
                        "فرندة",
                        "قرطوفة",
                        "حمادية",
                        "قصر الشلالة",
                        "مادنة",
                        "مهدية",
                        "مشروع الصفا",
                        "مدريسة",
                        "مدروسة",
                        "مغيلة",
                        "ملاكو ندورة",
                        "النعيمة",
                        "واد ليلي",
                        "ولاد جراد",
                        "رحوية",
                        "رشيقة سباين",
                        "سبت",
                        "سرغين",
                        "سي عبد الغاني",
                        "سيدي علي ملال",
                        "سيدي بختي",
                        "سيدي الحسني",
                        "السوقر",
                        "تاقدمت",
                        "تخمارت",
                        "تيارت",
                        "تيدة",
                        "زمالة الأمير عبد القادر",
                    ]),
                    add(),
                    shippingprice("14")),
                "15 ~ تيزي وزو" == a &&
                    ((communes = [
                        "تيزي وزو",
                        "واسيف",
                        "أيت بومهدي",
                        "أيت تودرت",
                        "عين الحمام",
                        "أيت يح أقبيل",
                        "أبي يوسف",
                        "عزازقة",
                        "فريحة",
                        "زكري",
                        "إعكوران",
                        "إيفيغاء",
                        "بوغني",
                        "مشطراس",
                        "بونوح",
                        "أسي يوسف",
                        "ذراع الميزان",
                        "فريقات",
                        "عين الزاوية",
                        "أيت يحي موسى",
                        "واقنون",
                        "تيميزارت",
                        "جبل عيسى ميمون",
                        "الأربعاء نايث إيراثن",
                        "أيت قواشة",
                        "إرجن",
                        "أزفون",
                        "أقرو",
                        "أيت شفعة",
                        "أغريب",
                        "ذراع بن خدة",
                        "تادمايت",
                        "سيدي نعمان",
                        "ترمتين",
                        "تقزيرت",
                        "إفليسن",
                        "مزرانة",
                        "بوزغن",
                        "إجر",
                        "إيلولة أمالو",
                        "بني زيكي",
                        "بني دوالة",
                        "أيت محمود",
                        "بني عيسي",
                        "بني زمنزر",
                        "واضية",
                        "أقني قغران",
                        "تيزي نثلاثة",
                        "أيت بوعدو",
                        "المعاتقة ",
                        "سوق الإثنين",
                        "مقلع",
                        "أيت خليلي ",
                        "الصوامع",
                        "بني يني",
                        "يطافن ",
                        "إبودرارن",
                        "تيزي راشد ",
                        "أيت أومالو",
                        "إيفرحونن",
                        "أمسوحال",
                        "إليلتن",
                        "تيزي غنيف ",
                        "مكيرة",
                        "ماكودة",
                        "بوجيمة",
                    ]),
                    add(),
                    shippingprice("15")),
                "16 ~ الجزائر" == a &&
                    ((communes = [
                        "سيدي امحمد",
                        "المدنية",
                        "المرادية",
                        "باب الواد",
                        "القصبة",
                        "بولوغين",
                        "واد قريش",
                        "رايس حميدو",
                        "المقارية",
                        "الحامة - العناصر بلوزداد ",
                        "حسين داي",
                        "القبة",
                        "بن عكنون",
                        "بني مسوس",
                        "بوزريعة",
                        "الأبيار",
                        "بئر مراد رايس",
                        "بئر خادم",
                        "جسر قسنطينة",
                        "حيدرة",
                        "سحاولة",
                        "باش جراح",
                        "بوروبة",
                        "الحراش",
                        "وادي السمار",
                        "عين طاية",
                        "باب الزوار",
                        "برج البحري",
                        "برج الكيفان",
                        "الدار البيضاء",
                        "المرسى",
                        "المحمدية",
                        "عين البنيان",
                        "الشراقة",
                        "دالي ابراهيم",
                        "أولاد فايت",
                        "الحمامات",
                        "المحالمة",
                        "الرحمانية",
                        "السويدانية",
                        "سطاوالي",
                        "زرالدة",
                        "بابا حسن",
                        "دويرة",
                        "الدرارية",
                        "العاشور",
                        "خرايسية",
                        "بئر توتة",
                        "أولاد شبل",
                        "تسالة المرجة",
                        "براقي",
                        "الكاليتوس",
                        "سيدي موسى",
                        "هراوة",
                        "الرغاية",
                        "الرويبة",
                    ]),
                    add(),
                    shippingprice("16")),
                "17 ~ الجلفة" == a &&
                    ((communes = [
                        "الجلفة",
                        "عين وسارة",
                        "القرنيني",
                        "البيرين",
                        "بنهار",
                        "سيدي لعجال",
                        "الخميس",
                        "حاسي فدول",
                        "حد الصحاري",
                        "بويرة الأحداب",
                        "عين أفقه",
                        "حاسي بحبح",
                        "الزعفران",
                        "حاسي العش",
                        "عين معبد",
                        "دار الشيوخ",
                        "مليليحة",
                        "سيدي بايزيد",
                        "الشارف",
                        "القديد",
                        "بن يعقوب",
                        "الإدريسية",
                        "الدويس",
                        "عين الشهداء",
                        "عين الإبل",
                        "مجبارة",
                        "تعضميت",
                        "زكار",
                        "مسعد",
                        "دلدول",
                        "سلمانة",
                        "سد رحال",
                        "قطارة",
                        "فيض البطمة",
                        "عمورة",
                        "أم العظام",
                    ]),
                    add(),
                    shippingprice("17")),
                "18 ~ جيجل" == a &&
                    ((communes = [
                        "جيجل",
                        "الأمير عبد القادر",
                        "اولاد رابح",
                        "اولاد يحيى خدروش",
                        "ايراقن سويسي",
                        "برج الطهر",
                        "بودريعة بن ياجيس",
                        "بوراوي بلهادف",
                        "بوسيف",
                        "تاكسنة",
                        "الجمعة بني حبيبي",
                        "جيملة",
                        "خيري واد اعجول",
                        "زيامة منصورية",
                        "السطارة",
                        "سلمى بن زيادة",
                        "سيدي عبد العزيز",
                        "سيدي معروف",
                        "الشحنة",
                        "الشقفة",
                        "الطاهير",
                        "العنصر",
                        "العوانة",
                        "غبالة",
                        "قاوس",
                        "القنار نشفي",
                        "الميلية",
                        "وجانة",
                    ]),
                    add(),
                    shippingprice("18")),
                "19 ~ سطيف" == a &&
                    ((communes = [
                        "عين عباسة",
                        "عين أرنات",
                        "عين الكبيرة",
                        "عين آزال",
                        "عين لحجر",
                        "عين لقراج",
                        "عين ولمان",
                        "عين الروى",
                        "عين السبت",
                        "آيت نوال",
                        "آيت تيزي",
                        "عموشة",
                        "ّ عين الروا",
                        "ّ عين الروى",
                        "بابور",
                        "بازر سكرة",
                        "بيضاء برج",
                        "بلاعة",
                        "بني عزيز",
                        "بني شيبانة",
                        "بني فودة",
                        "بني حسين",
                        "بني محلي",
                        "بني ورتيلان",
                        "بئر العرش",
                        "بئر حدادة",
                        "بوعنداس",
                        "بوقاعة",
                        "بوسلام",
                        "بوطالب",
                        "دهامشة",
                        "جميلة",
                        "ذراع قبيلة",
                        "العلمة",
                        "الولجة",
                        "الأوريسية",
                        "قلال",
                        "القلتة الزرقاء",
                        "قنزات",
                        "ڤجال",
                        "رأس الماء",
                        "الحامة",
                        "حمام قرقور",
                        "حربيل",
                        "قصر الأبطال",
                        "معاوية",
                        "ماوكلان",
                        "مزلوق",
                        "واد البارد",
                        "اولاد عدوان",
                        "اولاد صابر",
                        "اولاد تبان",
                        "ام لعجول",
                        "رسفة",
                        "صالح باي",
                        "سرج الغول",
                        "سطيف",
                        "تاشودة",
                        "تالة ايفاسن",
                        "الطاية",
                        "تلة",
                        "تيزي نبشار",
                        "ولاد السي أحمد",
                        "تيزي نبراهم",
                    ]),
                    add(),
                    shippingprice("19")),
                "20 ~ السعيدة" == a &&
                    ((communes = ["سعيدة", "عين الحجر", "عين السخونة", "عين سلطان", "ذوي ثابت", "الحساسنة", "معمورة", "مولاي لعربي", "أولاد براهيم", "أولاد خالد", "سيدي أحمد", "سيدي اعمر", "سيدي بوبكر", "تيرسين", "أيوب", "هونة"]),
                    add(),
                    shippingprice("20")),
                "21 ~ سكيكدة" == a &&
                    ((communes = [
                        "سكيكدة",
                        "حمادي كرومة",
                        "فلفلة",
                        "الحدائق",
                        "بوشطاطة",
                        "عين زويت",
                        "رمضان جمال",
                        "بني بشير",
                        "الحروش",
                        "صالح بوالشعور",
                        "أمجاز الدشيش",
                        "زردازة",
                        "أولاد أحبابة",
                        "سيدي مزغيش",
                        "عين بوزيان",
                        "بني ولبان",
                        "عزابة",
                        "السبت",
                        "لغدير",
                        "جندل",
                        "عين شرشار",
                        "بن عزوز",
                        "المرسى",
                        "بكوش لخضر",
                        "تمالوس",
                        "الكركرة",
                        "بين الويدان",
                        "القل",
                        "بني زيد",
                        "الشرايع",
                        "زيتونة",
                        "قنواع",
                        "عين قشرة",
                        "الوجلة بوالبلوط",
                        "أولاد عطية",
                        "خناق مايون",
                        "وادي الزهور",
                        "أم الطوب",
                    ]),
                    add(),
                    shippingprice("21")),
                "22 ~ سيدي بلعباس" == a &&
                    ((communes = [
                        "أولاد علي",
                        "أمرناس",
                        "بئر الحمام",
                        "بدر الدين المقراني",
                        "بلعربي",
                        "بن باديس",
                        "بن عشيبة شلية",
                        "بوجبع البرج",
                        "بوخنيفيس",
                        "تاودموت",
                        "تسالة",
                        "تلموني",
                        "تفسور",
                        "تغاليمت",
                        "تلاغ",
                        "تنزارة",
                        "تنيرة",
                        "حاسي دحو",
                        "حاسي زهانة",
                        "الحصيبة",
                        "رأس الماء",
                        "رجم دموش",
                        "زروالة",
                        "سهالة ثاورة",
                        "سفيزف",
                        "سيدي اٍبراهيم",
                        "سيدي بلعباس",
                        "سيدي حمادوش",
                        "سيدي خالد",
                        "سيدي دحو الزائر",
                        "سيدي شعيب",
                        "سيدي علي بن يوب",
                        "سيدي علي بوسيدي",
                        "سيدي لحسن",
                        "سيدي يعقوب",
                        "شيطوان بليلة",
                        "الضاية",
                        "طابية",
                        "عين أدان",
                        "عين البرد",
                        "عين تندامين",
                        "عين الثريد",
                        "عين قادة",
                        "لمطار",
                        "مرحوم",
                        "مرين",
                        "مزاورو",
                        "مسيد",
                        "مصطفى بن إبراهيم",
                        "مقدرة",
                        "مولاي سليسن",
                        "واد تاوريرة",
                        "واد سفيون",
                        "واد السبع",
                    ]),
                    add(),
                    shippingprice("22")),
                "23 ~ عنابة" == a && ((communes = ["عنابة", "برحال", "الحجار", "العلمة", "البوني", "وادي العنب", "الشرفة", "سرايدي", "عين الباردة", "شطايبي", "سيدي عمار", "تريعات"]), add(), shippingprice("23")),
                "24 ~ قالمة" == a &&
                    ((communes = [
                        "قالمة",
                        "قلعة",
                        "بو صبيع",
                        "بومهرة احمد",
                        "جبالة الخميسي",
                        "الفجوج",
                        "بن جراح",
                        "بلخير",
                        "بوعاتي محمود",
                        "هيليوبوليس",
                        "نشامية",
                        "بني مزلين",
                        "لخزارة",
                        "بوشقوف",
                        "مجاز الصفاء",
                        "حمام النبائل",
                        "وادي الشحم",
                        "الدهوارة",
                        "عين بن بيضاء",
                        "وادي فراغة",
                        "عين صندل",
                        "بوحشانة",
                        "وادي الزناتي",
                        "راس العقبة",
                        "عين رقادة",
                        "بوحمدان",
                        "برج صباط",
                        "الركنية",
                        "سلاوة عنونة",
                        "عين مخلوف",
                        "تاملوكة",
                        "حمام دباغ",
                        "مجاز عمار",
                        "عين العربي",
                        "هواري بومدين",
                    ]),
                    add(),
                    shippingprice("24")),
                "25 ~ قسنطينة" == a &&
                    ((communes = ["قسنطينة", "الخروب", "عين سمارة", "أولاد رحمون", "عين عبيد", "ابن باديس", "زيغود يوسف", "بني حميدان", "حامة بوزيان", "ديدوش مراد", "ابن زياد", "مسعود بوجريو"]), add(), shippingprice("25")),
                "26 ~ المدية" == a &&
                    ((communes = [
                        "أم الجليل",
                        "أولاد إبراهيم",
                        "أولاد بو عشرة",
                        "أولاد دايد",
                        "أولاد عنتر",
                        "أولاد معرف",
                        "أولاد هلال",
                        "البرواقية",
                        "بن شكاو",
                        "بني سليمان",
                        "بوسكن",
                        "بوشراحيل",
                        "بو عيش",
                        "بو عيشون",
                        "بوغار",
                        "بوغزول",
                        "بعطة",
                        "بئر بن عابد",
                        "تابلاط",
                        "تافراوت",
                        "تمزقيدة",
                        "تيزي المهدي",
                        "ثلاثة الدوائر",
                        "جواب",
                        "الحمدانية",
                        "حناشة",
                        "الحوضان",
                        "خمس جوامع",
                        "دراق",
                        "ذراع السمار",
                        "الربعية",
                        "الزبيرية",
                        "سانق",
                        "سدراية",
                        "سغوان",
                        "السواقي",
                        "سي المحجوب",
                        "سيدي دامد",
                        "سيدي الربيع",
                        "سيدي نعمان",
                        "سيدي زهار",
                        "سيدي زيان",
                        "الشهبونية",
                        "عزيز",
                        "العزيزية",
                        "العمارية",
                        "العوينات",
                        "العيساوية",
                        "عين بوسيف",
                        "عين القصير",
                        "قصر البخاري",
                        "القلب الكبير",
                        "الكاف الأخضر",
                        "مغراوة",
                        "المدية",
                        "مجبر",
                        "المفاتحة",
                        "مزغنة",
                        "ميهوب",
                        "وامري",
                        "وزرة",
                        "وادي حربيل",
                    ]),
                    add(),
                    shippingprice("26")),
                "27 ~ مستغانم" == a &&
                    ((communes = [
                        "مستغانم",
                        "ستيدية",
                        "مزغران",
                        "حاسي مماش",
                        "الصور",
                        "سيدي بلعطار",
                        "واد الخير",
                        "عين تادلس",
                        "سيرات، السوافلية",
                        "الصفصاف",
                        "بوقيرات",
                        "تازقايت",
                        "أولاد مع الله",
                        "سيدي علي",
                        "نقمارية",
                        "خضرة",
                        "أولاد بوغالم",
                        "عشعاشة",
                        "فرناكة، الحسيان",
                        "عين النويصي",
                        "منصورة",
                        "الطواهرية",
                        "عين سيدي",
                        "شريف ماسرى",
                        "حجاج",
                        "بن عبد المالك رمضان",
                        "سيدي لخضر",
                        "صيادة",
                        "عين بودينار",
                        "خير الدين",
                    ]),
                    add(),
                    shippingprice("27")),
                "28 ~ المسيلة" == a &&
                    ((communes = [
                        "المسيلة",
                        "أولاد دراج",
                        "أولاد سليمان ",
                        "أولاد سيدي إبراهيم ",
                        "أولاد عدي القبالة",
                        "أولاد عطية ",
                        "أولاد ماضي",
                        "أولاد منصور",
                        "أولتام",
                        "الحوامد",
                        "الزرزور ",
                        "المعاريف",
                        "المعاضيد ",
                        "الهامل",
                        "بئر الفضة",
                        "برهوم",
                        "بلدية ثنية الشارة",
                        "بلدية مناعة ",
                        "بلعايبة",
                        "بن سرور",
                        "بنزوه",
                        "بني يلمان",
                        "بوسعادة",
                        "بوطي السايح",
                        "تارمونت",
                        "تامسة",
                        "جبل أمساعد",
                        "حمام الضلعة",
                        "خبانة",
                        "خطوطي سد الجير",
                        "الدهاهنة",
                        "سليم ",
                        "سيدي امحمد ",
                        "سيدي عامر",
                        "سيدي عيسى ",
                        "سيدي هجرس",
                        "شلال ",
                        "الصوامع ",
                        "عين الحجل",
                        "عين الريش",
                        "عين الملح",
                        "عين الخضراء ",
                        "عين فارس ",
                        "مجدل ",
                        "محمد بوضياف ",
                        "مسيف",
                        "المطارفة ",
                        "مقرة ",
                        "ونوغة",
                    ]),
                    add(),
                    shippingprice("28")),
                "29 ~ معسكر" == a &&
                    ((communes = [
                        "معسكر",
                        "البرج ",
                        "البنيان",
                        "السحايلية",
                        "الشرفة ",
                        "الصحاورية",
                        "العلايمية",
                        "الغمري",
                        "القعدة",
                        "القيطنة",
                        "المامونية",
                        "المحمدية ",
                        "المنور ",
                        "الهاشم",
                        "بوحنيفية",
                        "بوهني",
                        "تيزي ",
                        "تيغنيف",
                        "حسين ",
                        "خلوية ",
                        "دوار الملح",
                        "رأس عين عميروش",
                        "زلامطة",
                        "زهانة",
                        "سجرارة",
                        "سيدي بوسعيد ",
                        "سيدي عبد الجبار",
                        "سيدي عبد المؤمن",
                        "سيدي قادة",
                        "عقاز",
                        "عوف",
                        "عين افرص",
                        "عين فارس ",
                        "عين فراح",
                        "عين فكان",
                        "غروس",
                        "غريس ",
                        "فراقيق",
                        "فروحة",
                        "قرجوم",
                        "القرط",
                        "ماقضة",
                        "ماوسة",
                        "مطمور",
                        "مقطع دوز",
                        "نسموط",
                        "وادي الأبطال",
                        "وادي تاغية",
                    ]),
                    add(),
                    shippingprice("29")),
                "30 ~ ورقلة" == a &&
                    ((communes = [
                        "ورقلة",
                        "الطيبات",
                        "بن ناصر",
                        "المنقر",
                        "مقارين",
                        "سيدي سليمان",
                        "تماسين",
                        "بلدة أعمر",
                        "الحجيرة",
                        "العالية",
                        "النقوسة",
                        "سيدي خويلد",
                        "عين البيضاء",
                        "حاسي بن عبد الله",
                        "الرويسات",
                        "البرمة",
                        "حاسي مسعود",
                        "تقرت",
                        "الزاوية العابدية",
                        "النزلة",
                        "تبسبست",
                    ]),
                    add(),
                    shippingprice("30")),
                "31 ~ وهران" == a &&
                    ((communes = [
                        "وهران",
                        "أرزيو",
                        "العلايمية",
                        "الكرمة ",
                        "بئر الجير",
                        "البرية ",
                        "بطيوة",
                        "بن فريحة",
                        "بوتليليس",
                        "بوسفر",
                        "بوفاطيس",
                        "حاسي بن عقبة",
                        "حاسي بونيف",
                        "حاسي مفسوخ",
                        "دوار الملح",
                        "السانية",
                        "سيدي الشحمي",
                        "سيدي بن يبقى",
                        "سيق",
                        "طفراوي",
                        "العنصر ",
                        "عين البية",
                        "عين الترك ",
                        "عين الكرمة ",
                        "قديل",
                        "مرسى الحجاج",
                        "المرسى الكبير",
                        "مسرغين",
                        "وادي تليلات",
                    ]),
                    add(),
                    shippingprice("31")),
                "32 ~ البيض" == a &&
                    ((communes = [
                        "البيض ",
                        "أربوات",
                        "الأبيض سيدي الشيخ",
                        "البنود",
                        "الخيثر",
                        "الرقاصة",
                        "الشلالة",
                        "المحرة",
                        "بريزينة",
                        "بوسمغون",
                        "بوعلام",
                        "بوقطب",
                        "توسمولين",
                        "ستيتن",
                        "سيدي سليمان ",
                        "سيدي طيفور",
                        "سيدي عمر ",
                        "شقيق ",
                        "عين العراك",
                        "الغاسول ",
                        "كاف لحمر",
                        "كراكدة",
                    ]),
                    add(),
                    shippingprice("32")),
                "33 ~ إليزي" == a && ((communes = ["ايليزي", "جانت", "الدبداب", "برج عمر ادريس", "برج الحواس", "ان امناس"]), add(), shippingprice("33")),
                "34 ~ برج بوعريريج" == a &&
                    ((communes = [
                        "برج بوعريريج",
                        "أولاد براهم ",
                        "أولاد دحمان",
                        "أولاد سيدي إبراهيم",
                        "الجعافرة ",
                        "الحمادية",
                        "العش",
                        "العناصر ",
                        "القلة ",
                        "القليعة ",
                        "الماين ",
                        "المهير",
                        "بئر قصد علي",
                        "برج الغدير",
                        "برج زمورة",
                        "بلدية عين تسرة",
                        "بليمور",
                        "بن داود",
                        "تاسمرت",
                        "تفرق",
                        "تفـرق",
                        "تقلعيت",
                        "تكستار",
                        "ثنية النصر",
                        "حرازة",
                        "حسناوة",
                        "خليل",
                        "رأس الوادي",
                        "الرابطة ",
                        "سيدي امبارك",
                        "عين تاغروت",
                        "غيلاسة",
                        "غيلاسة برج الغدير",
                        "القصور ",
                        "مجانة",
                        "المنصورة ",
                        "اليشير",
                    ]),
                    add(),
                    shippingprice("34")),
                "35 ~ بومرداس" == a &&
                    ((communes = [
                        "بومرداس",
                        "أولاد عيسى ",
                        "أولاد موسى ",
                        "أولاد هداج",
                        "اعفير",
                        "الأربعطاش",
                        "الثنية ",
                        "الثنية",
                        "الخروبة ",
                        "الناصرية ",
                        "برج منايل",
                        "بغلية",
                        "بن شود",
                        "بني عمران ",
                        "بودواو",
                        "بودواو البحري",
                        "تاورقة",
                        "تجلابين",
                        "تيمزريت ",
                        "جنات ",
                        "حمادي ",
                        "خميس الخشنة",
                        "دلس",
                        "زلزال زموري",
                        "زموري",
                        "سوق الحد",
                        "سي مصطفى",
                        "سيدي داود ",
                        "شعبة العامر",
                        "عمال ",
                        "قدارة",
                        "قورصو",
                        "لقاطة ",
                        "يسر",
                    ]),
                    add(),
                    shippingprice("35")),
                "36 ~ الطارف" == a &&
                    ((communes = [
                        "الطارف",
                        "بحيرة الطيور",
                        "بريحان",
                        "البسباس ",
                        "بن مهيدي ",
                        "بوثلجة",
                        "بوحجار",
                        "بوقوس",
                        "حمام بني صالح",
                        "الذرعان",
                        "رمل السوق",
                        "زريزر",
                        "الزيتونة ",
                        "السوارخ",
                        "الشافية ",
                        "شبيطة مختار",
                        "الشط ",
                        "الشيحاني",
                        "عصفور ",
                        "عين العسل",
                        "عين الكرمة ",
                        "العيون ",
                        "القالة",
                        "واد الزيتون",
                    ]),
                    add(),
                    shippingprice("36")),
                "37 ~ تندوف" == a && ((communes = ["تيندوف", "أم العسل"]), add(), shippingprice("37")),
                "38 ~ تسيمسيلت" == a &&
                    ((communes = [
                        "تيسمسيلت",
                        "ثنية الحد",
                        "برج بونعامة",
                        "لرجام",
                        "الأزهرية",
                        "الأربعاء",
                        "بوقايد",
                        "سيدي سليمان",
                        "بني شعيب",
                        "بني لحسن",
                        "عماري",
                        "اليوسفية",
                        "سيدي بوتشنت",
                        "الملعب",
                        "سيدي عابد",
                        "أولاد بسام",
                        "خميستي",
                        "العيون",
                        "برج الأمير عبد القادر",
                        "سيدي العنتري",
                        "تملاحت",
                        "المعاصم",
                    ]),
                    add(),
                    shippingprice("38")),
                "39 ~ الوادي(واد سوف)" == a &&
                    ((communes = [
                        "الوادي",
                        "أميه ونسة",
                        "البياضة ",
                        "الحمادين",
                        "الحمراية",
                        "الدبيلة",
                        "الرباح ",
                        "الرقيبة",
                        "الطريفاوي",
                        "العقلة ",
                        "المقرن ",
                        "النخلة  ",
                        "بن قشة",
                        "تغزوت ",
                        "تندلة",
                        "حاسي خليفة",
                        "حساني عبد الكريم",
                        "دوار الماء",
                        "سيدي عون",
                        "طالب العربي",
                        "عين الشوشة",
                        "قمار ",
                        "كوينين ",
                        "وادي العلندة",
                        "ورماس",
                        "وغلانة",
                    ]),
                    add(),
                    shippingprice("39")),
                "40 ~ خنشلة" == a &&
                    ((communes = [
                        "خنشلة",
                        "المحمل",
                        "عين الطويلة",
                        "بابار",
                        "بغاي",
                        "بوحمامة",
                        "شيليا",
                        "ششار",
                        "جلال",
                        "الحامة",
                        "الولجة",
                        "أنسيغة",
                        "قايس",
                        "خيران",
                        "لمصارة",
                        "متوسة",
                        "أولاد رشاش",
                        "رميلة",
                        "طامزة",
                        "يابوس",
                        "تاوزيانت",
                    ]),
                    add(),
                    shippingprice("40")),
                "41 ~ سوق اهراس" == a &&
                    ((communes = [
                        "سوق أهراس",
                        "أم العظائم",
                        "أولاد إدريس",
                        "أولاد مؤمن",
                        "الحنانشة",
                        "الراقوبة",
                        "الزوابي",
                        "بئر بوحوش",
                        "تاورة",
                        "ترقالت",
                        "تيفاش",
                        "الحدادة ",
                        "الخضارة",
                        "خميسة",
                        "الدريعة",
                        "الزعرورية",
                        "سافل الويدان",
                        "سدراتة",
                        "سيدي فرج ",
                        "عين زانة",
                        "عين سلطان ",
                        "مادور",
                        "مداوروش",
                        "المراهنة",
                        "المشروحة",
                        "وادي الكبريت",
                        "ويلان",
                    ]),
                    add(),
                    shippingprice("41")),
                "42 ~ تيبازة" == a &&
                    ((communes = [
                        "تيبازة",
                        "أغبال ",
                        "الداموس",
                        "الشعيبة",
                        "الناظور ",
                        "بني ميلك",
                        "بو إسماعيل",
                        "بورقيقة",
                        "بوهارون",
                        "حجرة النص",
                        "حجوط",
                        "حطاطبة",
                        "حمر العين",
                        "خميستي ",
                        "دواودة",
                        "سيدي اعمر ",
                        "سيدي راشد",
                        "سيدي سميان",
                        "سيدي غيلاس",
                        "شرشال",
                        "عين تقورايت",
                        "فوكة ",
                        "القليعة ",
                        "قوراية",
                        "لارهاط",
                        "مراد ",
                        "مسلمون ",
                        "مناصر",
                    ]),
                    add(),
                    shippingprice("42")),
                "43 ~ ميلة" == a &&
                    ((communes = [
                        "ميلة",
                        "أحمد راشدي ",
                        "أولاد خلوف ",
                        "التلاغمة",
                        "الرواشد ",
                        "العياضي برباس",
                        "القرارم قوقة",
                        "المشيرة",
                        "بن يحيى عبد الرحمان",
                        "بوحاتم",
                        "تاجنانت",
                        "تبرقنت",
                        "ترعي باينان",
                        "تسالة لمطاعي",
                        "تسدان حدادة",
                        "حمالة",
                        "دراحي بوصلاح",
                        "رجاص",
                        "زغاية",
                        "سيدي خليفة ",
                        "سيدي مروان",
                        "شلغوم العيد",
                        "الشيقارة",
                        "عميرة أراس",
                        "عين البيضاء حريش",
                        "عين التين",
                        "عين الملوك",
                        "فرجيوة",
                        "مينار زارزة",
                        "وادي العثمانية",
                        "وادي النجاء",
                        "وادي سقان",
                        "يحيى بن قشة",
                    ]),
                    add(),
                    shippingprice("43")),
                "44 ~ عين الدفلى" == a &&
                    ((communes = [
                        "عين الدفلى",
                        "الحسنية ",
                        "الحسينية ",
                        "الروينة",
                        "العبادية ",
                        "الماين ",
                        "المخاطرية",
                        "بئر ولد خليفة",
                        "بربوش",
                        "برج الأمير خالد",
                        "بطحية",
                        "بلعاص",
                        "بن علال ",
                        "بوراشد",
                        "بومدفع",
                        "تاشتة زقاغة",
                        "تسيلي",
                        "تيبركانين",
                        "جليدة ",
                        "جمعة ولاد الشيخ",
                        "جندل ",
                        "حمام ريغة",
                        "خميس مليانة",
                        "زدين",
                        "سيدي الأخضر ",
                        "طارق بن زياد ",
                        "العامرة ",
                        "عريب ",
                        "العطاف",
                        "عين بنيان ",
                        "عين بويحيى",
                        "عين تركي",
                        "عين سلطان ",
                        "عين لشياخ",
                        "مليانة",
                        "واد الشرفاء",
                        "وادي الجمعة",
                    ]),
                    add(),
                    shippingprice("44")),
                "45 ~ النعامة" == a && ((communes = ["النعامة", "المشرية", "عين الصفراء", "تيوت", "صفيصيفة", "مغرار", "عسلة", "جنين بورزق", "عين بن خليل", "بن عمار", "القصدير", "البيوض"]), add(), shippingprice("45")),
                "46 ~ عين تموشنت" == a &&
                    ((communes = [
                        "عين تموشنت",
                        "بوزجار",
                        "المالح",
                        "تارقة",
                        "حمام بوحجر",
                        "بني صاف",
                        "شعبة اللحم",
                        "الأمير عبد القادر",
                        "سيدي الصافي",
                        "تامازوغة",
                        "وادي الصباح",
                        "اغلال",
                        "أولاد الكيحل",
                        "عقب الليل",
                        "حاسى الغلة",
                        "أولاد بوجمعة",
                        "سيدي بن عدة",
                        "العامرية",
                        "عين الطلبة",
                        "عين الأربعاء",
                        "ولهاصة الغرابة",
                        "سيدي ورياش",
                        "عين الكيحل",
                        "مساعيد",
                        "وادي برقش",
                        "شنتوف",
                        "الحساسنة",
                        "سيدي بومدين",
                    ]),
                    add(),
                    shippingprice("46")),
                "47 ~ غرداية" == a && ((communes = ["غرداية", "العطف ", "بريان", "بنورة", "حاسي الفحل", "حاسي القارة", "زلفانة", "سبسب", "ضاية بن ضحوة", "القرارة ", "متليلي", "المنصورة"]), add(), shippingprice("47")),
                "48 ~ غليزان" == a &&
                    ((communes = [
                        "غليزان",
                        "أولاد سيدي الميهوب",
                        "أولاد يعيش ",
                        "الحمادنة",
                        "الرمكة",
                        "القطار ",
                        "القلعة ",
                        "المرجة ",
                        "المطمر ",
                        "الولجة ",
                        "بلعسل",
                        "بن داود ",
                        "بني درقن",
                        "بني زنطيس",
                        "جديوية",
                        "الحاسي ",
                        "حد الشكالة",
                        "حمري ",
                        "دار بن عبد الله ",
                        "زمورة ",
                        "سوق الحد ",
                        "سيدي امحمد بن علي",
                        "سيدي خطاب",
                        "سيدي سعادة",
                        "سيدي لزرق",
                        "سيدي محمد بن عودة",
                        "عمي موسى",
                        "عين الرحمة",
                        "عين طارق",
                        "لحلاف",
                        "مازونة",
                        "مديونة ",
                        "منداس",
                        "واد الجمعة ",
                        "واد السلام",
                        "وادي ارهيو",
                        "واريزان",
                        "يلل",
                    ]),
                    add(),
                    shippingprice("48")),
                "49 ~ تيميمون" == a && ((communes = ["تيميون", "أولاد السعيد", "أقروت", "دلدول", "المطرفة", "تينركوك", "قصر قدور", "شروين", "طلمين", "أولاد عيسى"]), add(), shippingprice("49")),
                "50 ~ برج باجي مختار" == a && ((communes = ["برج باجي مختار", "تيمياوين"]), add(), shippingprice("50")),
                "51 ~ أولاد جلال" == a && ((communes = ["اولاد جلال", "البسباس", "الشعيبة", "الدوسن", "سيدي خالد", "راس الميعاد"]), add(), shippingprice("51")),
                "52 ~ بني عباس" == a && ((communes = ["بن عباس", "بني يخلف", "الواتة", "إقلي", "كرزاز", "قصابي", "أولاد خدير", "تبلبالة", "تامترت", "تيمودي"]), add(), shippingprice("52")),
                "53 ~ عين صالح" == a && ((communes = ["عين صالح", "فقارة الزاوية", "عين غار"]), add(), shippingprice("53")),
                "54 ~ عين قزام" == a && ((communes = ["عين قزام", "تين زواتين"]), add(), shippingprice("54")),
                "55 ~ توقرت" == a &&
                    ((communes = ["البرمة", "الحجيرة", "الزاوية العابدية", "الطيبات", "العالية ", "المنقر", "النزلة ", "بلدة عمر", "بن ناصر", "تبسبست", "تقرت", "تماسين", "سيدي سليمان ", "مقارين"]), add(), shippingprice("55")),
                "56 ~ جانت" == a && ((communes = ["جانت", "برج الحواس"]), add(), shippingprice("56")),
                "57 ~ المغير" == a && ((communes = ["المغير", "أم الطيور ", "اسطيل", "تندلة", "جامعة ", "سيدي خليل", "سيدي عمران", "مرارة"]), add(), shippingprice("57")),
                "58 ~ المنيعة" == a && ((communes = ["المنيعة", "حاسي القارة", "المنصورة ", "حاسي لفحل"]), add(), shippingprice("58"));
        });
</script>

<script>
    $(document).ready(function () {
        molakhas();
    });

    function molakhas() {
        var html = "<div id='molakhas'> <p>&nbsp;ملخص الطلبية 📝&nbsp;</p></div>";
        $("#express-checkout-form").append(html);
    }
    $(document).on("change", $("select[name='" + nameWilaya + ""), function () {
        var wilaya = $("select[name='" + nameWilaya + "").val();

        $("#molakhas").html("");
        var html = "";
        if (wilaya == "") {
            html = "<div id='molakhas'> <p>&nbsp;ملخص الطلبية 📝&nbsp;</p></div>";
        } else {
            html = "<div id='molakhas'> <p>&nbsp;ملخص الطلبية 📝&nbsp;</p></div>";
        }
        $("#molakhas").html(html);
    });
</script>

<script>
    $(document).ready(function () {
        productprice();
    });

    function productprice() {
        var price = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.value").textContent;
        var currency = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.currency").textContent;
        var html = "<div id='productprice'</div><h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + price + "&nbsp;" + currency + "</h6>";
        $("#express-checkout-form").append(html);
    }
    $(document).on("change", $("select[name='" + nameWilaya + ""), function () {
        var wilayi = $('input[name="اختر أحد العروض و استفد من توصيل مجاني و تخفيض"]:checked').val();
        var wilaya = $("select[name='" + nameWilaya + "").val();
        var price = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.value").textContent;
        var currency = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.currency").textContent;
        var price1 = parseInt(price);
        var towpise = price1;
        var tripise = price1;
        var towfree = price1;

        $("#productprice").html("");
        var html = "";
        if (wilayi === "قطعة واحدة + سعر التوصيل") {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + price + currency + "</h6>";
        } else if (wilayi === "قطعتين + توصيل مجاني") {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + towpise + currency + "</h6>";
        } else if (wilayi === "قطعتين + سعر التوصيل") {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + towpise + currency + "</h6>";
        } else if (wilayi === "ثلاث قطع + توصيل مجاني + خصم 200 دج") {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + tripise + currency + "</h6>";
        } else if (wilayi === "قطعة واحدة + توصيل مجاني") {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + price + currency + "</h6>";
        } else if (wilayi === "قطعتين + توصيل مجاني + خصم 100 دج") {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + towfree + currency + "</h6>";
        } else {
            html = "<h5>~ سعر المنتج 🏷️ ⬅️</h5><h6>" + price + currency + "</h6>";
        }

        $("#productprice").html(html);
    });
</script>

<script>
    $(document).ready(function () {
        addWilayaContainer();
    });

    function addWilayaContainer() {
        var html = "<div id='tarifWilayaContainer'</div><h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>اختر الولاية</h6>";
        $("#express-checkout-form").append(html);
    }
    $(document).on("change", $('input[name="اختر أحد العروض و استفد من توصيل مجاني و تخفيض"]:checked'), function () {
        var wilay = $('input[name="اختر أحد العروض و استفد من توصيل مجاني و تخفيض"]:checked').val();
        var wilaya = $("select[name='" + nameWilaya + "").val();
        var stopdesk = $("select[name='" + stoppdesk + "").val();
        $("#tarifWilayaContainer").html("");
        var html = "";
        if (wilaya == "01 ~ أدرار") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "02 ~ الشلف") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "03 ~ الأغواط") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "04 ~ أم البواقي") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "05 ~ باتنة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "06 ~ بجاية") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "07 ~ بسكرة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "08 ~ بشار") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "09 ~ البليدة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "10 ~ البويرة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "11 ~ تمنراست") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "12 ~ تبسة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "13 ~ تلمسان") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "14 ~ تيارت") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "15 ~ تيزي وزو") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "16 ~ الجزائر") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "17 ~ الجلفة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "18 ~ جيجل") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "19 ~ سطيف") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "20 ~ السعيدة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "21 ~ سكيكدة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "22 ~ سيدي بلعباس") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "23 ~ عنابة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "24 ~ قالمة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "25 ~ قسنطينة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "26 ~ المدية") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "27 ~ مستغانم") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "28 ~ المسيلة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "29 ~ معسكر") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "30 ~ ورقلة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "31 ~ وهران") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "32 ~ البيض") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "33 ~ إليزي") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "34 ~ برج بوعريريج") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "35 ~ بومرداس") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "36 ~ الطارف") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "37 ~ تندوف") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "38 ~ تسيمسيلت") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "39 ~ الوادي(واد سوف)") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "40 ~ خنشلة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "41 ~ سوق اهراس") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "42 ~ تيبازة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "43 ~ ميلة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "44 ~ عين الدفلى") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "45 ~ النعامة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "46 ~ عين تموشنت") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "47 ~ غرداية") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "48 ~ غليزان") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>700 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "49 ~ تيميمون") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "50 ~ برج باجي مختار") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "51 ~ أولاد جلال") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "52 ~ بني عباس") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "53 ~ عين صالح") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "54 ~ عين قزام") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "55 ~ توقرت") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "56 ~ جانت") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "57 ~ المغير") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else if (wilaya == "58 ~ المنيعة") {
            html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>900 دج</h6>";
            if (wilay == "قطعتين + توصيل مجاني" || wilay == "ثلاث قطع + توصيل مجاني + خصم 200 دج" || wilay == "قطعة واحدة + توصيل مجاني" || wilay == "قطعتين + توصيل مجاني + خصم 100 دج") {
                html = "<h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>00 دج</h6>";
            } else if (stopdesk == "التوصيل للمكتب") {
                html = "</div><h5>- سعر التوصيل للمكتب ⬅️</h5><h6>400 دج</h6>";
            }
        } else {
            html = "<div id='tarifWilayaContainer'</div><h5>~ سعر التوصيل 🚚 ⬅️</h5><h6>اختر الولاية</h6>";
        }

        $("#tarifWilayaContainer").html(html);
    });
</script>

<script>
    $(document).ready(function () {
        total();
    });

    function total() {
        var html = "<div id='total'</div><h5>~ المبلغ الاجمالي 💰 ⬅️</h5><h6>المنتج + التوصيل</h6>";
        $("#express-checkout-form").append(html);
    }
    $(document).on("change", $('input[name="اختر أحد العروض و استفد من توصيل مجاني و تخفيض"]:checked'), function () {
        var wilay = $('input[name="اختر أحد العروض و استفد من توصيل مجاني و تخفيض"]:checked').val();
        var wilaya = $("select[name='" + nameWilaya + "").val();
        var product = document.querySelector("#productprice > h6").textContent;
        var ship = document.querySelector("#tarifWilayaContainer > h6").textContent;
        var currency = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.currency").textContent;
        var pship1 = parseInt(product);
        var price1 = parseInt(ship);
        var total1 = pship1 + price1;

        $("#total").html("");
        var html = "";
        if (
            wilaya == "01 ~ أدرار" ||
            wilaya == "02 ~ الشلف" ||
            wilaya == "03 ~ الأغواط" ||
            wilaya == "04 ~ أم البواقي" ||
            wilaya == "05 ~ باتنة" ||
            wilaya == "06 ~ بجاية" ||
            wilaya == "07 ~ بسكرة" ||
            wilaya == "08 ~ بشار" ||
            wilaya == "09 ~ البليدة" ||
            wilaya == "10 ~ البويرة" ||
            wilaya == "11 ~ تمنراست" ||
            wilaya == "12 ~ تبسة" ||
            wilaya == "13 ~ تلمسان" ||
            wilaya == "14 ~ تيارت" ||
            wilaya == "15 ~ تيزي وزو" ||
            wilaya == "16 ~ الجزائر" ||
            wilaya == "17 ~ الجلفة" ||
            wilaya == "18 ~ جيجل" ||
            wilaya == "19 ~ سطيف" ||
            wilaya == "20 ~ السعيدة" ||
            wilaya == "21 ~ سكيكدة" ||
            wilaya == "22 ~ سيدي بلعباس" ||
            wilaya == "23 ~ عنابة" ||
            wilaya == "24 ~ قالمة" ||
            wilaya == "25 ~ قسنطينة" ||
            wilaya == "26 ~ المدية" ||
            wilaya == "27 ~ مستغانم" ||
            wilaya == "28 ~ المسيلة" ||
            wilaya == "29 ~ معسكر" ||
            wilaya == "30 ~ ورقلة" ||
            wilaya == "31 ~ وهران" ||
            wilaya == "32 ~ البيض" ||
            wilaya == "33 ~ إليزي" ||
            wilaya == "34 ~ برج بوعريريج" ||
            wilaya == "35 ~ بومرداس" ||
            wilaya == "36 ~ الطارف" ||
            wilaya == "37 ~ تندوف" ||
            wilaya == "38 ~ تسيمسيلت" ||
            wilaya == "39 ~ الوادي(واد سوف)" ||
            wilaya == "40 ~ خنشلة" ||
            wilaya == "41 ~ سوق اهراس" ||
            wilaya == "42 ~ تيبازة" ||
            wilaya == "43 ~ ميلة" ||
            wilaya == "44 ~ عين الدفلى" ||
            wilaya == "45 ~ النعامة" ||
            wilaya == "46 ~ عين تموشنت" ||
            wilaya == "47 ~ غرداية" ||
            wilaya == "48 ~ غليزان" ||
            wilaya == "49 ~ تيميمون" ||
            wilaya == "50 ~ برج باجي مختار" ||
            wilaya == "51 ~ أولاد جلال" ||
            wilaya == "52 ~ بني عباس" ||
            wilaya == "53 ~ عين صالح" ||
            wilaya == "54 ~ عين قزام" ||
            wilaya == "55 ~ توقرت" ||
            wilaya == "56 ~ جانت" ||
            wilaya == "57 ~ المغير" ||
            wilaya == "58 ~ المنيعة"
        ) {
            html = "<h5>~ المبلغ الاجمالي 💰 ⬅️</h5>" + "<h6>" + total1 + "&nbsp;" + currency + "</h6>";
        } else {
            html = "<div id='total'</div><h5>~ المبلغ الاجمالي 💰 ⬅️</h5><h6>المنتج + التوصيل</h6>";
        }

        $("#total").html(html);
    });
</script>

<script>
    var price_befff = document.querySelector("div.product-section.price-section > h2 > span.before.currency-value") !== null;
    if (price_befff) {
        var price_aft = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.value").textContent;
        var price_bef = document.querySelector("div.product-section.price-section > h2 > span.before.currency-value > span.value").textContent;
        var price1_bef = parseInt(price_bef);
        var price1_aft = parseInt(price_aft);
        var price_place = document.querySelector("div.product-section.price-section > h2 > span.before.currency-value");
        var disCount = document.createElement("span");
        disCount.setAttribute("class", "discount_prcnt");
        //price_place.insertBefore(disCount, price_place.firstChild);
        var prcntg = (price_aft * 100) / price_bef;
        var prcntg1 = Math.round(100 - prcntg).toString();
        disCount.innerHTML = "<style>.discount_prcnt{background-color:#0097FF; font-weight:bold;border-radius: 4px;padding: 2px 5px;color: #fff; font-size: 15px;margin-left: 13px;}</style>خصم" + "&nbsp;" + prcntg1 + "%";
        price_place.after(disCount);
    }
</script>

<script>
    for (let e = 0; e < document.querySelectorAll("div.product-item").length; e++) {
        var b,
            result,
            div,
            a = parseInt(document.querySelectorAll("div.product-item")[e].querySelectorAll("span.value")[0].innerText);
        null != document.querySelectorAll("div.product-item")[e].querySelectorAll("span.value")[1] &&
            ((b = parseInt(document.querySelectorAll("div.product-item")[e].querySelectorAll("span.value")[1].innerText)),
            (result = a - b),
            ((div = document.createElement("div")).style.position = "absolute"),
            (div.style.width = "80px"),
            (div.style.borderRadius = "15px"),
            (div.style.padding = "2px"),
            (div.style.textAlign = "center"),
            (div.style.color = "var(--primary-color)"),
            (div.style.border = "solid"),
            (div.style.borderBlockColor = "var(--primary-color)"),
            (div.style.borderWidth = "2px"),
            (div.style.zIndex = "1"),
            (div.style.margin = "5px"),
            (div.style.fontWeight = "bold"),
            (div.style.backgroundColor = "#ffffff7a "),
            (div.innerText = " 🔥تخفيض! " + result + "دج"),
            document.querySelectorAll("div.product-item")[e].prepend(div));
    }
</script>

<script>
    const DivContainer = document.getElementsByClassName("product-title"); //home page
    const DavContainer = document.getElementsByClassName("product-section price-section"); //product page
    if (DivContainer.length !== 0) {
        function AddNewHome() {
            const newDiv = document.createElement("div");
            newDiv.innerHTML =
                '<span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><style>span.fa.fa-star.checked {color: #FFC107;transform: scale(1.3);margin: 10px 4px 0px 4px;}</style>';
            DivContainer[i].appendChild(newDiv);
        }
        for (i = 0; i < DivContainer.length; i++) {
            AddNewHome();
        }
    }

    if (DavContainer.length !== 0) {
        function insertAfter(referenceNode, newNode) {
            referenceNode.parentNode.insertBefore(newNode, referenceNode.nextSibling);
        }
        const newDav = document.createElement("div");
        newDav.setAttribute("class", "rvw_stars");
        newDav.innerHTML =
            '<span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><span class="fa fa-star checked"></span><style>span.fa.fa-star.checked {POSITION: relative;left: 4px;color: #FFC107;transform: scale(1.4);margin: 0px 8px 12px 0px;}</style>';
        insertAfter(DavContainer[0], newDav);
    }
</script>

<script>
    var StarsGrid = document.getElementsByClassName("reviews-body");
    if (StarsGrid.length !== 0) {
        var StarsNumb = StarsGrid[0].children.length;
        const reviewsBtn = document.createElement("button");
        reviewsBtn.innerHTML = "مشاهدة التعليقات";
        reviewsBtn.style.backgroundColor = "#4984F9";
        reviewsBtn.style.color = "#fff";
        reviewsBtn.style.border = "1px solid #ccc";
        reviewsBtn.style.borderRadius = "5px";
        reviewsBtn.style.padding = "5px";
        reviewsBtn.style.marginRight = "10px";
        reviewsBtn.style.cursor = "pointer";
        reviewsBtn.addEventListener("click", function () {
            const reviewsGrid = document.querySelector(".section-reviews");
            reviewsGrid.scrollIntoView({ behavior: "smooth" });
        });

        const Stars = document.querySelector("div.product-details > div.rvw_stars");
        Stars.appendChild(reviewsBtn);
    }
</script>

<script>
    var StarsGrid = document.getElementsByClassName("reviews-grid");
    if (StarsGrid.length !== 0) {
        var StarsNumb = StarsGrid[0].children.length;
        const NewStrzDiv = document.createElement("span");
        NewStrzDiv.setAttribute("class", "Strz");
        NewStrzDiv.innerHTML = "(" + StarsNumb.toString() + " مراجعات)<style>span.Strz {    font-size: 16px;    font-weight: bold;    color: #747474;    margin-right: 3px;}</style>";
        const Stars = document.querySelector("div.product-details > div.rvw_stars");
        Stars.appendChild(NewStrzDiv);
    }
</script>

<script>
    var Boutton = document.getElementsByClassName("single-submit");
    for (var counter = 0; counter <= Boutton.length; ++counter) {
        Boutton[counter].setAttribute("onclick", "runCommand()");
    }
</script>

<script>
    function runCommand() {
        const molakhas = document.getElementById("molakhas").textContent;
        const product = document.querySelector("h1").textContent;
        const productprice = document.querySelector("#productprice > h6").textContent;
        const tship = document.querySelector("#tarifWilayaContainer > h5").textContent;
        const pship = document.querySelector("#tarifWilayaContainer > h6").textContent;
        const total = document.querySelector("#total > h5").textContent;
        const totalprice = document.querySelector("#total > h6").textContent;
        const emla = document.querySelector("div.product-section.price-section > h2 > span.after.currency-value > span.currency").textContent;
        const chbih = document.getElementById("related-products").innerHTML;

        localStorage.setItem("molakhs", molakhas);
        localStorage.setItem("prodwi", product);
        localStorage.setItem("proprise", productprice);
        localStorage.setItem("titreship", tship);
        localStorage.setItem("priceship", pship);
        localStorage.setItem("totalti", total);
        localStorage.setItem("totalpric", totalprice);
        localStorage.setItem("da", emla);
        localStorage.setItem("pruchbih", chbih);

        return;
    }
</script>

<script>
    
    var buy_button = document.getElementsByClassName("button single-submit");
    if (buy_button.length !== 0) {
        var shopping_cart = document.createElement("i");
        shopping_cart.setAttribute("class", "fa fa-shopping-cart");
        var shopping_cart1 = document.createElement("i");
        shopping_cart1.setAttribute("class", "fa fa-shopping-cart");
        buy_button[0].appendChild(shopping_cart);
        buy_button[1].appendChild(shopping_cart1);
    }
</script>

<script>
    var buy_button = document.querySelector("div.product-section.add-to-cart-section > button");
    if (buy_button !== null) {
        if (buy_button.disabled === false) {
            var code =
                '<style>@keyframes ring {0% {transform: rotate(0)}1% {transform: rotate(15deg)}3% {transform: rotate(-14deg)}5% {transform: rotate(17deg)}7% {transform: rotate(-16deg)}9% {transform: rotate(15deg)}11% {transform: rotate(-14deg)}13% {transform: rotate(13deg)}15% {transform: rotate(-12deg)}17% {transform: rotate(12deg)}19% {transform: rotate(-10deg)}21% {transform: rotate(9deg)}23% {transform: rotate(-8deg)}25% {transform: rotate(7deg)}27% {transform: rotate(-5deg)}29% {transform: rotate(5deg)}31% {transform: rotate(-4deg)}33% {transform: rotate(3deg)}35% {transform: rotate(-2deg)}37% {transform: rotate(1deg)}39% {transform: rotate(-1deg)}41% {transform: rotate(1deg)}43% {transform: rotate(0)}to {transform: rotate(0)}}i.fa.fa-shopping-cart { animation: ring 3s ease-in-out .7s infinite; font-size: 18px; margin-left: 5px;}.single-product .single-submit { color: #ffffff; background-color: #0097FF; display: flex; flex-direction: row-reverse; overflow: hidden; position: relative; border: 2px solid #D0021BFFFF !important;}@keyframes shiny-btn1 {0% {opacity: 0;transform: scale(0) rotate(45deg)}80% {opacity: .5;transform: scale(0) rotate(45deg)}81% {opacity: 1;transform: scale(4) rotate(45deg)}to {opacity: 0;transform: scale(50) rotate(45deg)}}button.button.single-submit:before { animation: shiny-btn1 4s ease-in-out infinite; background-color: #fff; content: ""; display: inline-block; height: 100%; left: 0; position: absolute; top: -180px; width: 30px;}button.button.single-submit:after{ background-color: #678983FF;}@keyframes button-loading-spin{from{transform:rotate(0turn);}to {transform:rotate(1turn);}}.add-to-cart-section .single-submit:disabled {opacity:1;font-size:0px;}.is-loading::after { content: ""; position: absolute; width: 19px; height: 19px; top: 0; left: 0; right: 0; bottom: 0; margin: auto; border: 4px solid transparent; border-top-color: white; border-radius: 50%; animation: button-loading-spin 1s ease infinite;}.button { transition: all 0s;}</style>';
            buy_button.insertAdjacentHTML("afterend", code);
        } else {
            var cart1 = document.querySelector("div.product-section.add-to-cart-section > button > i");
            cart1.remove();
            var cart2 = document.querySelector("div.product-section.add-to-cart-section.disabled > button > i");
            cart2.remove();
        }
    }
</script>

<script>
    document.querySelector(".checkout-heading").style.textAlign = "center";
</script>

<script>
    document.querySelector(".single-order-body").remove();
    document.querySelector(".message-header").remove();
    document.querySelector(".app-heading").remove();
    document.querySelector(".single-order").remove();
</script>

<script>

    var submitButtons = document.getElementsByClassName("single-submit");

    var captchaInput = document.getElementsByName(fieldName)[0];
    captchaInput.setAttribute("oninput", "validateCaptchaInputs()");

    function validateCaptchaInputs() {
        var inputcaptchavalue = captchaInput.value;
        var submitButton = document.querySelector(".single-submit");

        if (inputcaptchavalue === captchavalue) {
            captchaInput.style.setProperty("background-color", "white", "important");
            captchaInput.style.setProperty("color", "black", "important");
            submitButton.removeAttribute("disabled");
        } else {
            captchaInput.style.setProperty("background-color", "#f8d7da", "important");
            captchaInput.style.setProperty("color", "black", "important");
            submitButton.setAttribute("disabled", "");
        }
    }

   </script>

<script>
    $(document).ready(function () {
        captchagoogle();
    });

    function captchagoogle() {
        const form = document.querySelector(".checkout-form");

        const newElementHTML = "<div id='captchagoogle'><div class='prev'></div><div class='captcha-form'><span class='captcha-refrech'><i class='fa fa-refresh fa-spin' aria-hidden='true'></i></span></div></div>";

        const targetElement = form.querySelector('[name="' + fieldName + '"]');

        targetElement.insertAdjacentHTML("beforebegin", newElementHTML);
    }

    const fonts = ["cursive", "sans-serif", "serif", "monospace"];
    let captchavalue = "";
    function generatorCaptcha() {
        let value = btoa(Math.random() * 1000000000);
        value = value.substring(0, 3 + Math.random() * 5);
        captchavalue = value;
    }

    function setCaptcha() {
        let html = captchavalue
            .split("")
            .map((char) => {
                const rotate = -20 + Math.trunc(Math.random() * 30);
                const font = Math.trunc(Math.random() * fonts.length);
                return `<span style="
              transform: rotate(${rotate}deg);
              font-family: ${fonts[font]};
              ">${char}</span>`;
            })
            .reverse()
            .join("");
        document.querySelector(".prev").innerHTML = html;
    }

    function initCaptcha() {
        document.querySelector(".captcha-form span.captcha-refrech").addEventListener("click", function () {
            $(document).ready(function () {
                generatorCaptcha();
                setCaptcha();
                validateCaptchaInputs();
            });
        });

        generatorCaptcha();
        setCaptcha();
    }

    $(document).ready(function () {
        initCaptcha();
    });
</script>

<!-- CAPTCHA NBR 
<script>
    var submitButtons = document.getElementsByClassName("single-submit");

    var captchaInput = document.getElementsByName(fieldName)[0];

    function validateCaptchaInputs() {
        var inputcaptchavalue = captchaInput.value;
        var submitButton = document.querySelector(".single-submit");

        if (inputcaptchavalue === captchavalue) {
            captchaInput.style.setProperty("background-color", "white", "important");
            captchaInput.style.setProperty("color", "black", "important");
            submitButton.removeAttribute("disabled");
        } else {
            captchaInput.style.setProperty("background-color", "#f8d7da", "important");
            captchaInput.style.setProperty("color", "black", "important");
            submitButton.setAttribute("disabled", "");
        }
    }

    $(document).ready(function () {
        initCaptcha();
    });

    function captchagoogle() {
        const form = document.querySelector(".checkout-form");

        const newElementHTML = "<div id='captchagoogle'><div class='prev'></div><div class='captcha-form'><span class='captcha-refrech'><i class='fa fa-refresh fa-spin' aria-hidden='true'></i></span></div></div>";

        const targetElement = form.querySelector('[name="' + fieldName + '"]');
        if (!document.getElementById('captchagoogle')) {
            targetElement.insertAdjacentHTML("beforebegin", newElementHTML);
        }
    }

    const fonts = ["cursive", "sans-serif", "serif", "monospace"];
    let captchavalue = "";
    function generatorCaptcha() {
        let value = "";
        for (let i = 0; i < 4; i++) {
            value += Math.floor(Math.random() * 10);
        }
        captchavalue = value;
    }

    function setCaptcha() {
        let html = captchavalue
            .split("")
            .map((char) => {
                const rotate = -20 + Math.trunc(Math.random() * 30);
                const font = Math.trunc(Math.random() * fonts.length);
                return `<span style="transform: rotate(${rotate}deg); font-family: ${fonts[font]};">${char}</span>`;
            })
            .reverse()
            .join("");
        document.querySelector(".prev").innerHTML = html;
    }

    function initCaptcha() {
        captchagoogle();

        document.querySelector(".captcha-form span.captcha-refrech").addEventListener("click", function () {
            generatorCaptcha();
            setCaptcha();
            validateCaptchaInputs();
        });

        generatorCaptcha();
        setCaptcha();

  
        captchaInput.addEventListener("input", function () {
            validateCaptchaInputs();
        });
    }
</script>-->


<script>
    setInterval(function () {
        let buttons = document.querySelectorAll(".single-product .single-submit");
        buttons.forEach((button) => {
            button.classList.toggle("shaked");
        });
    }, 3000);
</script>


<!-- CSS FILES -->
<style>
#molakhas p {
    display: flex;
    flex-direction: row;
    margin: 0px 0px -12px 0px;
    font-size: 15px;
    font-weight: bold;
}
#molakhas p:before,
#molakhas p:after,
.checkout-heading:before,
.checkout-heading:after {
    content: "";
    flex: 1 1;
    border-bottom: 1px solid;
    margin: auto;
}
#molakhas p:before,
.checkout-heading:before {
    margin-right: 10px;
}
#molakhas p:after,
.checkout-heading:after {
    margin-left: 10px;
}

h2.checkout-heading {
    display: flex;
    flex-direction: row;
    margin: 0px 0px -12px 0px;
    font-size: 15px;
    font-weight: bold;
}


#express-checkout-form {
    padding: 15px 15px 33px 15px;
    border-style: solid;
    border-width: 3px;
    border-color: var(--primary-color);
    border-radius: 10px;
    box-shadow: 2px 2px 2px 2px #888888;
    background-color: #f5f5f5;
}

.radio-buttons-container {
    font-weight: bold;
    padding: 10px 7px 7px 7px;
    border-style: none solid solid solid;
    border-width: 3px;
    border-color: var(--primary-color);
    border-radius: 0px 0px 10px 10px;
    box-shadow: 2px 2px 2px 2px #888888;
    background-color: #f5f5f5;
    position: relative;
    top: 12px;
}

.product-section.single-hurry-section {
    display: none;
}

.single-description {
    display: none;
}

.product-thumbnail {
    padding: 0 0 100%;
    border-radius: 8px;
    box-shadow: 0 0 20px 0px rgb(0 0 0 / 15%);
    border: 2px solid var(--primary-color);
    border-radius: 10px;
}

#total {
    font-weight: bold;
}

h6 {
    text-align: left;
    font-size: 1em;
}

h5 {
    text-align: right;
    position: relative;
    top: 22px;
    font-size: 1em;
}

[dir] h6 {
    margin: -5px;
}

[dir] h5 {
    margin: -10px 0px 5px 0px;
}

#total {
    padding: 5px 0px;
}

.rvw_stars {
    padding: 0px 5px 7px 5px;
}

#app + div span {
    display: none;
}

[dir] input[type="email"],
[dir] input[type="number"],
[dir] input[type="password"],
[dir] input[type="search"],
[dir] input[type="tel"],
[dir] input[type="text"],
[dir] input[type="url"],
[dir] textarea {
    border-radius: 3px;
    border: 1px solid black;
    padding: 10px 15px;
    background-color: #fafafa;
}

.checkout-section .checkout .main .checkout-form .checkout-heading {
    font-weight: 900;
}

[dir] .checkout-section .checkout .main .checkout-form .checkout-select select {
    border: 1px solid #060606;
    background-color: #fafafa;
}

.product-item .product-price .before {
    font-weight: bold;
}

.product-section.price-section {
    display: flex;
}

[dir] .product-item .product-actions {
    margin-top: auto;
}
.product-item .product-price {
    margin-bottom: 10px;
}
[dir] .product-item {
    display: flex;
    flex-direction: column;
    flex: 1;
}

[dir] .product-item .product-details {
    display: flex;
    flex-direction: column;
    flex: 1;
}

[dir] .single-product .product-wrapper .product-details .product-section:not(:last-child) {
    margin: 0 0 10px;
}

@media (max-width: 480px) {
    .products-grid,
    .categories-style-1 {
        grid-template-columns: repeat(2, 1fr);
    }
    .content-box-with-icon-section .grid-3 {
        grid-template-columns: repeat(3, 1fr);
        grid-column-gap: 10px;
    }

    [dir] .category-item .category-details {
        padding: 12px 0px;
        text-align: center;
        border-top: 1px solid #f0f0f0;
    }

    .content-box-with-icon-section .title {
        font-weight: 600;
        font-size: 13px;
    }
    .content-box-with-icon-section .description {
        font-size: 12px;
        word-break: break-word;
    }
    .content-box-with-icon-section .icon {
        display: block;
        height: 45px;
        width: 45px;
        line-height: 45px;
        font-size: 25px;
    }
    .products-grid .product-item .product-actions .button {
        min-width: 100%;
    }
    .footer .grid-3 {
        grid-template-columns: repeat(3, 1fr);
    }

    [dir] .single-price .before {
        margin: 2px 13px 0;
    }
}

.product-item .product-price .before {
    font-weight: bold;
}

.product-item .product-price .before {
    text-decoration: none;
    position: relative;
}
.product-item .product-price .before::before {
    top: 50%;
    background: red;
    opacity: 0.7;
    content: "";
    width: 110%;
    position: absolute;
    height: 1.5px;
    border-radius: 0.1em;
    left: -5%;
    white-space: nowrap;
    display: block;
    transform: rotate(-10deg);
}
.product-item .product-price .before.straight::before,
.product-item .product-price .before.straight::before {
    transform: rotate(0deg);
    left: -1%;
    width: 102%;
}

.single-product .single-price span.before {
    font-size: 26px;
    font-weight: bold;
    margin-left: 5px;
    line-height: 22px;
}

.single-product .single-price span.before {
    text-decoration: none;
    position: relative;
}
.single-product .single-price span.before::before {
    top: 60%; /*tweak this to adjust the vertical position if it's off a bit due to your font family */
    background: red; /*this is the color of the line*/
    opacity: 0.7;
    content: "";
    width: 110%;
    position: absolute;
    height: 2px;
    border-radius: 0.1em;
    left: -5%;
    white-space: nowrap;
    display: block;
    transform: rotate(-10deg);
}
.single-product .single-price span.before.straight::before,
.single-product .single-price span.before.straight::before {
    transform: rotate(0deg);
    left: -1%;
    width: 102%;
}

.single-product .single-submit {
    background-color: var(--primary-color) !important;
}

.single-product .single-submit:hover {
    background-color: var(--danger-color) !important;
}

.discount_prcnt {
    background-color: var(--primary-color) !important;
}

.product-item .product-actions .button {
    color: #ffffff !important;
    background-color: var(--primary-color) !important;
    border-color: #ffffff !important;
}

.product-item .product-actions .button:hover {
    color: var(--primary-color) !important;
    background-color: #ffffff !important;
    border-color: var(--primary-color) !important;
}

p.heading-description::before,
p.heading-description::after {
    content: "--------------  ";
}

.section-N03bxEt9QrH4z22G {
    padding-top: 30px;
    padding-bottom: 30px;
    background-color: #ffffff;
    color: #000000;
}
.section-N03bxEt9QrH4z22G .heading-primary {
    color: #000000;
}

.heading-description {
    color: var(--primary-color);
}
.product-item .product-title a {
    color: #000000;
}

.product-item .product-price .before {
    color: #747474;
}

.product-item .product-price .after {
    color: #14adebff;
}
.product-item,
.product-item .product-details {
    border-color: #f0f0f0;
}

.product-item:hover,
.product-item:hover .product-details {
    border-color: #14adebff;
}
.product-item .product-actions .button {
    color: #14adebff;
    background-color: #ffffff;
    border-color: #14adebff;
}

.product-item .product-actions .button:hover {
    color: #14adebff;
    background-color: #14adebff;
    border-color: #ffffff;
}
.load-more a,
.products-slider .slick-next,
.products-slider .slick-prev {
    color: #fff;
    border-color: var(--primary-color) !important;
    background-color: var(--primary-color) !important;
}

.load-more a:hover,
.products-slider .slick-next:hover,
.products-slider .slick-prev:hover {
    color: #fff;
    border-color: var(--secondary-color) !important;
    background-color: var(--secondary-color) !important;

}

.single-price {
    padding: 10px 10px;
}

.single-price .after {
    color: var(--primary-color) !important;
}

.checkout-section .checkout .main .checkout-form .checkout-groups .form-group > .form-label {
    display: block !important;
}

div#captchagoogle {
    text-align: center;
    font-weight: bold;
    display: flex;
    margin-bottom: 4px;
}

.prev {
    color: #333;
    width: 100%;
    text-align: center;
    height: 50px;
    line-height: 50px;
    letter-spacing: 8px;
    border: 1px dashed #333;
    font-family: monospace;
}

.captcha-form {
    display: flex;
}

.prev span {
    display: inline-block;
    user-select: none;
}

span.captcha-refrech {
    width: 40px;
    border: none;
    outline: none;
    background: var(--primary-color);
    cursor: pointer;
    color: #fff;
    border-radius: 5px;
    margin-right: 3px;
}

.fa-refresh {
    font: normal normal normal 58px/3 FontAwesome !important;
    font-size: 17px !important;
}

@keyframes shake-x {
    0% {
        -webkit-transform: translate(2px, 1px) rotate(0deg);
    }
    10% {
        -webkit-transform: translate(-1px, -2px) rotate(-1deg);
    }
    20% {
        -webkit-transform: translate(-3px, 0px) rotate(1deg);
    }
    30% {
        -webkit-transform: translate(0px, 2px) rotate(0deg);
    }
    40% {
        -webkit-transform: translate(1px, -1px) rotate(1deg);
    }
    50% {
        -webkit-transform: translate(-1px, 2px) rotate(-1deg);
    }
    60% {
        -webkit-transform: translate(-3px, 1px) rotate(0deg);
    }
    70% {
        -webkit-transform: translate(2px, 1px) rotate(-1deg);
    }
    80% {
        -webkit-transform: translate(-1px, -1px) rotate(1deg);
    }
    90% {
        -webkit-transform: translate(2px, 2px) rotate(0deg);
    }
    100% {
        -webkit-transform: translate(1px, -2px) rotate(-1deg);
    }
}
.single-product .single-submit.shaked {
    animation: shake-x 1s ease infinite;
}
.single-product .single-submit.shaked:hover {
    animation: none;
}

.single-product .single-title {
    text-align: center !important;
}

.single-title {
    line-height: 2.3 !important;
    font-size: 32px !important;
}

[dir] .single-product .preview {
    border: 3px solid var(--primary-color) !important;
    box-shadow: 2px 2px 2px 2px #888888 !important;
    border-radius: 0px 0px 10px 10px !important;
}
.product-item .product-price .after {
    color: var(--primary-color) !important;
}
</style>
